start_menu_text = """
Приветствую, {}! 👋

👇 Выбери нужную для себя услугу:
"""

start_user_info_text = """
🆕 Пользователь @{} запустил бота! 

ℹ️ Его данные:

    👤 Имя: {}

    👤 Фамилия: {}

    🆔 Telegram ID: {}

    🤴 Наличие Telegram Premium: {}

    🌐 Код языка: {}
"""

send_your_name_text = "✍️ Напишите своё имя"

send_your_phoneNumber_text = """
Отлично! ✅

✍️ Теперь напишите свой номер телефона в формате: "+79999999999".
"""

send_pdf_file_text = "✅ Запрошенная вами методичка:"

your_phoneNumber_is_invalid_text = "‼️ Введённый вами номер телефона некорректный! Попробуйте ещё раз."

send_contact_data_to_manager_text = """
🗂 Контактные данные пользователя @{}:

👤 Имя: {}

📞 Номер телефона: {}
"""

send_your_data_for_analyz_text = "✍️ Напишите текст/прикрепите картинки. Данные пришлются на анализ менеджеру."

send_data_for_analyz_to_manager_success_text = "✅ Ваши данные успешно отправлены на анализ менеджеру!"

send_data_for_analyz_to_manager_text = """
📝 Данные на анализ пользователя @{}:

Текст:
<i>{}</i>
"""

send_data_for_analyz_to_manager_mediagroup_text = """
📝 Данные на анализ пользователя @{}:

Текст:
<i>{}</i>

👇 Изображения, прикреплённые к сообщению:
"""

send_data_for_analyz_to_manager_with_images_without_text = "📝 Изображения на анализ пользователя @{}:"

send_data_for_analyz_to_manager_with_image_without_text = "📝 Изображение на анализ пользователя @{}:"

data_is_invalid_text = "‼️ Некорректные данные! Попробуйте ещё раз."

send_data_for_analyz_to_manager_only_images_text = "‼️ Прикреплять можно только изображения! Попробуйте ещё раз."

send_your_question_text = "✍️ Напишите ваш вопрос менеджеру"

send_user_question_to_manager_text = """
❓ Вопрос пользователя @{}:

<i>{}</i>
"""

send_user_question_to_manager_success_text = "✅ Ваш вопрос успешно отправлен менеджеру!"
