start_text = """
В этом боте вы можете:

1️⃣ получить бесплатное руководство по выбору управляющего в сфере алгоритмического трейдинга

2️⃣ отправить данные по выбранной вами стратегии алгоритмического трейдинга и получить бесплатный экспертный анализ

3️⃣ подписаться на получение наших квартальных отчётов с результатами работы

4️⃣ получить наши контакты (тг-канал, сайт, контакт для связи)

5️⃣ задать вопрос менеджеру

По всем вопросам пишите: @AlgorithmicaTeam
"""

start_menu_text = "Выберите, что вы хотите получить:"

start_user_info_text = """
🆕 Пользователь {} запустил бота! 
    👤 Имя: {}
    👤 Фамилия: {}
    🆔 Telegram ID: {}
    🤴 Наличие Telegram Premium: {}
    🌐 Код языка: {}
"""

username_is_required_text = "‼️ Для корректной работы бота, вам необходимо иметь username!"

send_your_name_with_username_text = "Напишите, пожалуйста, ваше имя:"

send_your_name_without_username_text = """
Ваше имя пользователя в Телеграм (через @), куда вы хотите получить руководство (его можно найти в разделе «Настройки» вашего Телеграм-аккаунта):
"""

send_your_phoneNumber_text = "Ваш номер телефона в формате +79…:"

send_pdf_file_text = """
Благодарим вас за интерес к алгоритмическому трейдингу и нашему руководству!

В ближайшие дни мы пришлём вам обновлённую версию нашего руководства с аккаунта @AlgorithmicaTeam 🤝

Также вы можете писать на @AlgorithmicaTeam по любым вопросам, в том числе если хотите получить руководство иным способом, например, на почту или вотсап.
"""

your_phoneNumber_is_invalid_text = "‼️ Введённый вами номер телефона некорректный! Попробуйте ещё раз."

send_contact_data_to_manager_text = """
«Руководство»
🗂 Контактные данные пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
"""

send_data_to_manager_for_reports_text = """
«Подписка»
🗂 Контактные данные пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
"""

send_data_to_manager_for_reports_success_text = """
Благодарим вас за подписку!
Первый отчёт пришлём вам по итогу текущего квартала до 15 {}. А отчёт за прошедший квартал мы отправим вам с аккаунта @AlgorithmicaTeam уже в ближайшие дни. 🤝
"""

send_your_data_for_analyz_text = "Пришлите, пожалуйста, все имеющиеся у вас данные в свободном формате в виде текста и/или прикрепите файлы, требующие анализа:"

send_data_for_analyz_to_manager_success_text = """
Благодарим за ваш запрос!
Мы изучим предоставленные вами данные, подготовим развёрнутый ответ и свяжемся с вами в течение недели с аккаунта @AlgorithmicaTeam 🤝
"""

send_data_for_analyz_to_manager_text = """
«Анализ данных» 
📝 Данные на анализ пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
📞 Телефон: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
Текст:
<i>{}</i>
"""

send_data_for_analyz_to_manager_mediagroup_text = """
«Анализ данных» 
📝 Данные на анализ пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
📞 Телефон: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
Текст:
<i>{}</i>
☝️ Файлы, прикреплённые к сообщению:
"""

send_data_for_analyz_to_manager_mediagroup_without_text_text = """
«Анализ данных» 
📝 Данные на анализ пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
📞 Телефон: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
☝️ Файлы, прикреплённые к сообщению:
"""

send_data_for_analyz_to_manager_with_images_without_text = """
«Анализ данных» 
Данные пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
📞 Телефон: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
"""

send_data_for_analyz_to_manager_with_images_with_text = """
«Анализ данных» 
Данные пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
📞 Телефон: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
Текст:
<i>{}</i>
"""

send_data_for_analyz_to_user_text = """
Проверьте содержимое вашего обращения:

Текст:
<i>{}</i>
"""

send_data_for_analyz_to_user_mediagroup_text = """
Проверьте содержимое вашего обращения:

Текст:
<i>{}</i>

☝️ Файлы, прикреплённые к сообщению:
"""

send_data_for_analyz_to_user_mediagroup_without_text_text = """
☝️ Проверьте файлы, прикреплённые к сообщению
"""

send_data_for_analyz_to_user_with_images_without_text = """
Проверьте содержимое вашего обращения.
"""

send_data_for_analyz_to_user_with_images_with_text = """
Проверьте содержимое вашего обращения:

Текст:
<i>{}</i>
"""

send_data_for_analyz_continue_text = "Хотите добавить ещё какие-либо текстовые данные или файлы/изображения?"

send_data_for_analyz_continue_yes_text = "Просто допишите необходимый текст или прикрепите необходимые файлы:"

send_data_for_analyz_success_text = """
Благодарим за ваш запрос!
Мы изучим предоставленные вами данные, подготовим развёрнутый ответ и свяжемся с вами в течение недели с аккаунта @AlgorithmicaTeam 🤝
"""

data_is_invalid_text = "‼️ Некорректные данные! Попробуйте ещё раз."

send_data_for_analyz_to_manager_formatError_text = "‼️ Неверный формат файла! Попробуйте ещё раз."

send_your_question_text = "Напишите ваш вопрос менеджеру:"

send_user_question_to_manager_text = """
❓ Вопрос пользователя {}:
🆔 Telegram ID: {}
Текст:
<i>{}</i>
"""

send_user_question_to_manager_success_text = """
Благодарим вас за сообщение!
Мы ответим вам в ближайшее время с аккаунта @AlgorithmicaTeam.
"""

our_reports_text = """
Благодарим за ваш интерес к нашим результатам!

Обещаем не присылать спам, а отправлять только запрошенные отчёты по итогу календарного квартала.

Для подписки введите, пожалуйста, ваше имя:
"""

our_contacts_text = """
Телеграм-канал: @algorithmica
Сайт: https://algorithmica.io

По всем вопросам пишите: https://t.me/AlgorithmicaTeam
"""

user_join_contacts_info_text = """
🆕 Пользователь {} зашёл в раздел "Наши контакты"! 
    👤 Имя: {}
    👤 Фамилия: {}
    🆔 Telegram ID: {}
    🤴 Наличие Telegram Premium: {}
    🌐 Код языка: {}
"""

crypto_draw_success_text = '''
Благодарим за участие!
В течение недели мы проведём розыгрыш среди участников лотереи, подписанных на наш канал @algorithmica и напишем вам о его итогах.

По всем вопросам наш контакт для связи: https://t.me/AlgorithmicaTeam
'''

send_data_to_manager_for_crypto_draw_text = """
«Розыгрыш криптовалюты»
🗂 Контактные данные пользователя {}:
🆔 Telegram ID: {}
👤 Имя: {}
👤 Фамилия: {}
🤴 Наличие Telegram Premium: {}
🌐 Код языка: {}
"""

crypto_draw_turn_on_text = '🟢 Розыгрыш криптовалюты успешно включен!'

crypto_draw_turn_off_text = '🔴 Розыгрыш криптовалюты успешно выключен!'